<a href="https://colab.research.google.com/github/Rishabh9559/Data_science/blob/main/Pandas_complete_course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas**
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

### **why Pandas used**
* Pandas allows us to analyze big data and make conclusions based on statistical theories.
* Pandas can clean messy data sets and make them readable and relevant
* Relevant data is very important in data science.

In [1]:
# Import pandas
import pandas as pd

## **Series**
A Pandas series is like a column in a Table

It is a one dimensional array holding data of any type.

### **Labels**
Labesl is index number - start from 0 and goes on.

In [2]:
db = pd.Series([1,2,3,4,5,6])
print(db)
w

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
# Pandas give name
db.name = "Array"
print(db)

0    1
1    2
2    3
3    4
4    5
5    6
Name: Array, dtype: int64

### **Check Data types**

In [38]:
print(db.dtype)

int64

In [7]:
# iloc -> location based indexing
db.iloc[1]

np.int64(2)

In [8]:
# multi location based
# iloc -> works only number index start from 0,1,....
db.iloc[[2,3,4]]

2    3
3    4
4    5
Name: Array, dtype: int64

### **Create Labels**
By useing index method we can used own labels name

In [10]:
# creating index
index = ['apple', 'banana', 'mongo', 'orange', 'date','waterlemon']

db.index = index
db.name ='cost'
db

apple         1
banana        2
mongo         3
orange        4
date          5
waterlemon    6
Name: cost, dtype: int64

In [12]:
# Retrive value
db['banana': 'date']

banana    2
mongo     3
orange    4
date      5
Name: cost, dtype: int64

### **Locate Row**
Pandas use the **loc** attribute to return one or more specified row

In [13]:
# loc -> indexing current
# single
db.loc['banana']

np.int64(2)

In [14]:
# loc -> retrive value by current indexing
# list of indexes
db.loc[['banana','mongo', 'waterlemon']]

banana        2
mongo         3
waterlemon    6
Name: cost, dtype: int64

##### Example 2

In [15]:
fruit_protein = {
    "Avocado": 2.0,       # grams of protein
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}

In [19]:
fs = pd.Series(fruit_protein, name = 'Protein')
fs

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

### **Conditional Selection**

In [24]:
# Conditional Selection
## True or False

fs>2

Avocado         False
Guava            True
Blackberries    False
Oranges         False
Banana          False
Apples          False
Kiwi            False
Pomegranate     False
Mango           False
Cherries        False
Name: Protein, dtype: bool

In [25]:
# Condtional
# return value whose value is greater then
fs[fs>1.5]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Pomegranate     1.7
Name: Protein, dtype: float64

In [27]:
# Conditional value
# And -> &
fs[(fs>1) & (fs<2)]

Banana         1.1
Kiwi           1.1
Pomegranate    1.7
Name: Protein, dtype: float64

In [28]:
# Conditional value
# OR -> |

fs[(fs>1) | (fs>2) ]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protein, dtype: float64

In [29]:
# Condtional value
# NOT -> ~
fs[~(fs>1.5)]

Oranges     0.9
Banana      1.1
Apples      0.3
Kiwi        1.1
Mango       0.8
Cherries    1.0
Name: Protein, dtype: float64

### **Modifying value**

In [33]:
# modifiying value
fs['Mango'] = 3

print(fs['Mango'])

3.0

In [34]:
import numpy as np

| Value    | Defined in    | Type       | Equal to itself? | Typical use                     |
| -------- | ------------- | ---------- | ---------------- | ------------------------------- |
| `None`   | Python        | `NoneType` | ✅ Yes            | Missing object / null reference |
| `NaN`    | IEEE standard | `float`    | ❌ No             | Missing numeric data            |
| `np.nan` | NumPy         | `float`    | ❌ No             | Numerical arrays                |
| `pd.nan` | Pandas        | `float`    | ❌ No             | Missing values in DataFrames    |

In [40]:
ser = pd.Series(['a', np.nan, 1, np.nan, 2])
ser.notnull().sum()

np.int64(3)

## **DataFrame**

Dat sets in Pandas are usually multi-dimensional tables, called DataFrames.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [41]:
# DataFrame:

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}